# Fillna , Dropna, Interpolate

In [2]:
import pandas as pd


df = pd.read_excel("C:\\Users\\Vinsc\\OneDrive\\Documents\\5_pandas_.xlsx")

print(df)

  tickers    eps  Revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65            NaN
2    MSFT  -1.00       85    64     bill gates
3     RIL    NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

# checking the data type of tickers

In [3]:
type(df.tickers[0])

str

# setting 'tickers' as index

In [4]:
df.set_index('tickers' , inplace = True)

df

           eps  Revenue price         people
tickers
GOOGL    27.82       87   845     larry page
WMT       4.61      484    65            NaN
MSFT     -1.00       85    64     bill gates
RIL        NaN       50  1023  mukesh ambani
TATA      5.60       -1  n.a.     ratan tata

# filling all the 'nan' with the '0'

In [6]:
new_df = df.fillna({
    'eps' : 0,
    'price' : 0,
    'people' : 'no event'
})

new_df

           eps  Revenue price         people
tickers
GOOGL    27.82       87   845     larry page
WMT       4.61      484    65       no event
MSFT     -1.00       85    64     bill gates
RIL       0.00       50  1023  mukesh ambani
TATA      5.60       -1  n.a.     ratan tata

# using 'ffill' to insert the values from the above

In [ ]:
new_df = df.fillna(method = "ffill" , limit = 1)

new_df

# using 'bfill' to insert the values from the below row

In [8]:
new_df = df.fillna(method = 'bfill' , limit = 1)

new_df

C:\Users\Vinsc\AppData\Local\Temp\ipykernel_31096\2792666024.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_df = df.fillna(method = 'bfill' , limit = 1)

           eps  Revenue price         people
tickers
GOOGL    27.82       87   845     larry page
WMT       4.61      484    65     bill gates
MSFT     -1.00       85    64     bill gates
RIL       5.60       50  1023  mukesh ambani
TATA      5.60       -1  n.a.     ratan tata

#  using 'interpolate metod()' to insert the values on the 'nan' ...based on the values of its above and below

In [35]:
new_df = df.interpolate()
new_df

C:\Users\Vinsc\AppData\Local\Temp\ipykernel_11368\812076388.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  new_df = df.interpolate()

           eps  Revenue price         people
tickers
GOOGL    27.82       87   845     larry page
WMT       4.61      484    65            NaN
MSFT     -1.00       85    64     bill gates
RIL       2.30       50  1023  mukesh ambani
TATA      5.60       -1  n.a.     ratan tata